export const answers:string[] = ["แมว", "ดำ", "FALSE", "กบ", "วิเวก", "PEACH", "กุหลาบ", "หมวก", "แอบ", "INTERNET", "เกลา", "ขวนขวาย", "ข้าว", "IDOL", "แสง", "รองเท้า", "FILM", "VICTORY"]

export const hints: string[][] = [
   [
      "ชุดสีที่ปรากฏทางซ้ายบรรทัดแรกคือสี ดำ และ ส้ม ชุดสีบรรทัดที่ 2 คือสี แดง ชมพู ลูกศรทั้ง 2 ตัวเป็นสีดำ",
      "ภาพขวาคือภาพ 'ดม' มีความสัมพันธ์อะไรกับสีทางซ้ายนะ ?",
      "บรรทัดแรก คือสี 'ดำ' และ 'ส้ม' ลองดูสิว่าแต่สีดำมีเพียงแค่ครึ่งท่อนแรกเท่านั้น และสีส้มมีเพียงแค่ครึ่งท่อนหลังเท่านั้น",
      "ให้นำตัวอักษรด้าหน้าของสีแดง ตัวอักษรตรงกลางของสีชมพู และตัวอักษรด้านหลังของสีสุดท้ายมาประกอบกัน... คุณไม่เจอสีสุดท้ายเหรอ มันอาจจะกลืนไปกับพื้นหลังก็ได้นะ"
   ],
   [
      "ชุดสีไล่จากบนลงล่างได้แก่ ฟ้า ส้ม น้ำตาล เขียว ชมพู ม่วง เหลือง ส่วนวงกลมในประโยคคำถามสีดำ มีสีแดง",
      "หากมองด้วยตาเปล่า คุณอาจคิดว่าสีเหลืองเล็กที่สุด แต่ความจริงแล้ว ยังมีเล็กกว่านั้นอีก",
      "ในโจทย์ไม่ได้พูดถึงแค่ในกลุ่มวงกลมตรงกลางการ์ด ยังมีวงกลมตรงไหนอยู่อีกบ้าง ?",
      "สีแดงเล็กที่สุดหรอ... ยังมีเล็กกว่านั้นอีก ดูดี ๆ สิ",
   ],
   [
      "ทุกเส้นของตัวอักษรดิจิตัลมีลักษณะแบ่งออกเป็น 5 กลุ่มเหมือนกัน หมายถึงคำตอบ 5 ตัวอักษร",
      "เรียงลำดับไปตามช่องสีขาวเริ่มจากช่องทางซ้ายมือ(ที่โดนตัดมุม) ปรากฏบนเส้นไหนของตัวอักษรดิจิตัลบ้าง",
      "ตัวอักษรแรกคือ F",
   ],
   [
      "ทั้งรูปคอกบน และรูปคอกล่าง ต่างมีสัตว์จำนวนและชนิดเท่ากันหมดเลย มีบางอย่างแปลก ๆ",
      "จากโจทย์ไม่ได้หมายถึงรูปภาพ แต่หมายถึงข้อความในประโยคคำถาม",
      "สัตว์ชนิดใด อยู่ใน 'คอกบน' แต่ไม่อยู่ใน 'คอกล่าง' ในคำว่า 'คอกบน' มีชื่อสัตว์อยู่ด้วย",
   ],
   [
      "ภาพด้านล่างคือ กบ และ แกะ ทั้ง 2 มีความเกี่ยวข้องอะไรกับกลุ่มเส้นด้านบนนะ",
      "กลุ่มเส้นด้านบนเหมือนจะแยกออกจากกัน ลองมองให้เป็นกลุ่มตัวอักษร",
      "คำตอบมีคำว่า 'วิ' นำหน้า และมี 4 ตัวอักษร",
   ],
   [
      "เหมือนเส้นหลายเส้นจะหายไปนะ ลองเต็มให้ครบดูสิ",
      "เส้นขีด ๆ คือตัวอักษรดิจิตัล (7 segment display) โดยปกติแล้วหน้าจอเต็ม ๆ จะเป็นเลข 8 ลองเติมเส้นที่หายไปแล้วสังเกตุว่าเป้นตัวอักษรอะไร ",
      "ดูเหมือนว่าอักษรพวกนั้นจะกลับหัวนะ ลองกลับหัวดูสิ",
   ],
   [
      "เครื่องหมายทางคณิตศาสตร์ดูใกล้ตัวเลขแปลก ๆ จะหมายถึงอะไรบ้างนะ ?",
      "'บวก' 'ลบ' 'หาร' 'เท่ากับ' คำเหล่านี้ถ้าเทียบกับตัวเลขแล้วจะได้คำว่าอะไรนะ ?",
      "3+ คือ 'ก' และ 5= คือ 'บ'",
   ],
   [
      "ชุดภาพบนสื่อถึงคำว่า 'ตรวจ'",
      "ภาพชุดบน จากซ้ายไปขวาคือ 'ตบ' 'ราก' 'ดาว' และ 'จาน' ลองดูว่ามีความสัมพันธ์กับลูกษรอย่างไร",
      "ตัวอักษรทางซ้ายของคำว่า 'ตบ' คือ 'ต' ตัวอักษรทางขวาของคำว่า 'ดาว' คือ 'ว' จุดสีดำหมายถถึงอักษรตรงกลาง",
   ],
   [
      "วิเคราะห์จากภาพชุดล่างก่อน โดยภาพล่างสุดทางซ้ายหมายถึงคำว่า 'ไทย' ทางขวาหมายถึงคำว่า 'คาง' ",
      "ไทย ประกอบไปด้วย 'สระไอ' 'ท ทหาร' 'ย ยักษ์' เมื่อนำไปผสมกับอักษรชุดบนลูกศร จะได้คำที่มีความหมาย",
      "'ไอ'น้ำ , 'ทอ'ผ้า , หมู'ยอ' -> ไ ท ย ใช้หลักการเดียวกันกับคำชุดบน ",
   ],
   [
      "ลองอ่านอักษรย้อนกลับดูสิ",
      "เมื่ออ่านกลับหลัง จะได้เป็นคำภาษาอังกฤษเกี่ยวกับตัวเลข แบ่งชุดตัวอักษร จะพบตัวอักษรที่หายไป",
      "บรรทัดบนสุดคือ F O U R 3 H 5 E E แบ่งเป็น FOUR 3H5EE ดังนั้น 3 คือตัว T และ 5 คือตัว R",
   ],
   [
      "ไขปริศนาเขาวงกตก่อน จะได้คำว่า 'อ่านช่องว่าง' เห็นช่องว่างหรือเปล่า ?",
      "เมื่ออ่านตัวอักษรที่เหลือจากบนลงล่าง จะได้คำว่า 'ซ้ายไปขวา' แต่คำสั่งที่สองบอกให้อ่าน 'ช่องว่าง' ไม่ได้ให้อ่านตัวอักษรที่เหลือ! คำสั่งใหม่ที่ได้มาแค่ช่วยบอกว่าอ่านยังไง กลับไปอ่านช่องว่างอีกครั้ง",
      "ถมดำช่องบนเส้นทาง ช่องที่ไม่ถูกถมจะเป็น 4 กลุ่มแยกกัน มองช่องและกำแพงเป็นตัวอักษร 4 ตัวได้ อ่านจากซ้ายไปขวา จะได้คำที่มีความหมาย",
   ],
   [
      "ภาพที่เห็นคือมือซ้ายและมือขวา แต่ดูเหมือนว่าภาพจะหายไปบางส่วน จะสามารถสื่อถึงอะไรได้บ้างนะ ?",
      "ส่วนที่หายไป หายประมาณ 1 ใน 3 'ซ้าย' และ 'ขวา' ถ้าหายไป 1 ใน 3 จะเหลือตัวอักษรอะไร ?",
      "'ขวา' หายไป 1 ใน 3 ด้านหลัง เหลือ 'ขว'  'ซ้าย' หายไป 1 ใน 3 ด้านหลัง เหลือ 'าย'  แทนค่าในภาพ จะได้เป็นคำว่า",
   ],
   [
      "สามภาพแรกคือ 'แสดง', 'ท้อง', และ 'ส้อม'",
      "สีลูกศรทั้งสามคือ 'แดง', 'ทอง', และ 'ส้ม' หาความเกี่ยวข้องกับภาพให้เจอ",
      "ลูกศรที่สี่มีสีด้วยนะ แต่ที่เรามองไม่เห็นเพราะมันคือสีอะไร ? เติมตัวอักษรภาษาไทยเพิ่ม 1 ตัว ให้ได้คำตอบที่เป็นพืช",
   ],
   [
      "เริ่มจากเชื่อมตัว C ไปหาตัว G วางตัวอักษรดี ๆ ไม่ให้ขวางทางตัวอักษรตัวอื่น",
      "C ↓ D → E ↑ F ↑ G",
      "ไล่ตัวอักษรตามเส้นทางไปเรื่อย ๆ จนครบ และนำตัวอักษรในช่องที่มีภาพเหมือนกันเรียนกัน จะได้เป็นชื่อหนึ่ง",
   ],
   [
      "'2' คือ สอง ส่วน 'เ' สามตัวนั้น ที่จริงคือสระแอตามด้วยสระเอ",
      "แทน ส อ ง ลงไปแทนเลข 2 จะพบว่ามีการประกอบคำใหม่ขึ้นมา แล้วยังแทนค่าอะไรได้อีกบ้างนะ ?",
      "แ เ สื อ งู -> เปลี่ยนคำว่าเสือ และงูเป็นตัวอักษร",
   ],
   [
      "ภาพชุดบนสุด ภาพซ้ายคือ 'ปา' ภาพขวาคือ 'ป่า'",
      "ภาพชุดที่ 2 ทางซ้ายคือ 'ผ่า' ภาพขวาคือ 'ผา' ดูเหมือนภาพทางซ้ายจะไม่สนวรรณยุกต์นะ",
      "ภาพที่อยู่ในดวงดาวเปลี่ยนวรรณยุกต์ตามทิศทางบนดวงดาว โดยเริ่มที่เสียงสามัญชี้ตรงขึ้นด้านบน วนตามเข็มนาฬิกา",
   ],
   [
      "ตัวเลข 5 ตัว แต่ถอดรหัสได้ 4 ตัวอักษร แปลว่าไม่ได้ดูที่ช่อง แล้วมีวิธีอื่นมั้ยนะ",
      "ช่องว่างระหว่างตัวเลขในตารางด้านบนดูกว้าง ๆ นะ เหมือนใส่อะไรได้",
      "ใส่ตัวอักษรภาษาอังกฤษในช่องว่าง ช่องละ 1 ตัว ไล่ตามลำดับ จากนั้นเวลาถอดรหัสให้เดินจากตัวเลข 5 ตัวเป็นเส้นทาง และอ่านตัวอักษรที่ถูกเดินผ่าน",
   ],
   [
      "ไขปริศนา 1 - 17 ให้ครบก่อน มันสำคัญมาก",
      "ชุดภาพทางซ้ายมือ คุ้น ๆ ไหม ว่าเหมือนอะไร ใช่แล้ว มันคือขอบของชุดการ์ด Puzzle Card Deck Vol.1 นั่นเอง",
      "นำขอบการ์ดมาเรียนตามทิศทาง โดยลำดับการ์ดจะเรียงตามคำใบ้ของคำตอบทางด้านขวา",
      "การเรียงการ์ดชุดที่ 1: ขอบบนเรียงจากบนลงล่าง 1.แอบ 2.หมวก 3.แสง 4.วิเวก 5.กุหลาบ",
      "การเรียงการ์ดชุดที่ 2: ขอบขวา (หมุนซ้าย) เรียงจากบนลงล่าง 1.กบ 2.FALSE 3.ขวนขวาย 4.IDOL 5.ใช้การ์ด S1",
      "การเรียงการ์ดชุดที่ 3: ขอบล่าง (กลับหัว) เรียงจากบนลงล่าง 1.แมว 2.รองเท้า 3.กุหลาบ 4.INTERNET 5.ข้าว",
      "การเรียงการ์ดชุดที่ 4: ขอบขวาเรียงจากบนลงล่าง 1.PEACH 2.เกลา 3.ขวนขวาย 4.แสง 5.ดำ",
      "การอ่านคำตอบ 1: อ่านตัวอักษรตามสีของคำตอบบนการ์ดข้อ 2",
      "การอ่านคำตอบ 2: คำตอบคือสี 'ดำ' ดังนั้นอ่านตามตัวอักษรสีดำ ไม่สนใจสีอื่น จะได้คำตอบเป็นภาษาอังกฤษ 7 ตัวอักษร",
   ]
]

export const numNormalPuzzles: number = 17
export const numPuzzles: number = 18
let titles: string[] = Array.from({length: numNormalPuzzles}, (_, i) => "ไพ่หมายเลข " + (i + 1))
titles.push("ไพ่หมายเลข Special 1")

export const puzzleTitles: string[] = titles 