import type {IEvent} from '$lib/interfaces'

export const events: IEvent[] = [
   {
      type: "event",
      id: 1,
      title: "Exploding Countdown",
      date: "2020-01-25",
      image: 'event01.png',
      tags: ["event", "competition"],
      content: `💣 เวลา 99 นาทีกับภารกิจกู้ระเบิด จะทันหรือไม่? 💣

Code Breaker : Exploding Countdown เกมล่าปริศนา ขอท้านักไขใช้พลังสมอง ประลองกับเวลา วิ่งหาเบาะแสถอดรหัส

เปิดรอบเดียวเท่านั้น!
🔎 วันเสาร์ที่ 25 มกราคม 2020
🔎 เวลา 13.00 - 15.00 น.

🔎 ณ Mansion 7 (ตีรันฟันทอย บอร์ดเกม คาเฟ่ - Tea Run Fun Toy Board Game Cafe)
(แผนที่ https://goo.gl/maps/9fP1AtUkiwmAvuqcA)

🔎 ค่าสมัคร 300 บาทต่อคน`,
   },
   {
      type: "event",
      id: 2,
      title: "Thailand Board Game Show 2021",
      date: "2021-11-20",
      image: 'event02.jpg',
      tags: ["event", "kit"],
      content: "กิจกรรมแก้ปริศนาในงาน Thailand Board Game Show 2021",
   },
   
]